
## :x: Apply Failed

[CI link](https://github.com/kanade0404/zaim/actions/runs/7156177391)



<pre><code>Error: resource is in failed state &#34;Ready:False&#34;, message: Revision &#39;zaim-api-00004-z2b&#39; is not ready and cannot serve traffic. Image &#39;asia-northeast1-docker.pkg.dev/kanade0404/projects/kanade0404/locations/asia-northeast1/repositories/zaim-api/app&#39; not found.

  with google_cloud_run_service.app,
  on main.tf line 111, in resource &#34;google_cloud_run_service&#34; &#34;app&#34;:
 111: resource &#34;google_cloud_run_service&#34; &#34;app&#34; {


Error: Error applying IAM policy for service account &#39;projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com&#39;: Error setting IAM policy for service account &#39;projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com&#39;: googleapi: Error 400: Role roles/run.invoker is not supported for this resource., badRequest

  with module.pubsub-user.google_service_account_iam_member.service_iam[&#34;run.invoker&#34;],
  on modules/service_account/main.tf line 13, in resource &#34;google_service_account_iam_member&#34; &#34;service_iam&#34;:
  13: resource &#34;google_service_account_iam_member&#34; &#34;service_iam&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
random_uuid.uuid: Refreshing state... [id=a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SHARED]
module.zaim-func.google_service_account.account: Refreshing state... [id=projects/kanade0404/serviceAccounts/zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SEIYA]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/repositories/zaim-api]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SHARED]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SEIYA]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SEIYA]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SHARED]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SHARED]
module.zaim-file.google_storage_bucket.bucket: Refreshing state... [id=zaim-kanade0404-a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SEIYA]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SHARED]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SEIYA]
module.zaim-func.google_project_iam_member.iam["storage.objectUser"]: Refreshing state... [id=kanade0404/roles/storage.objectUser/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-func.google_project_iam_member.iam["secretmanager.secretAccessor"]: Refreshing state... [id=kanade0404/roles/secretmanager.secretAccessor/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SHARED/versions/1]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SEIYA/versions/1]
module.pubsub.google_pubsub_topic.topic: Refreshing state... [id=projects/kanade0404/topics/zaim-trigger]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SHARED/versions/1]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SEIYA/versions/1]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SHARED/versions/1]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SEIYA/versions/1]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SHARED/versions/1]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SEIYA/versions/1]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SHARED/versions/1]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SEIYA/versions/1]
module.scheduler.google_cloud_scheduler_job.scheduler: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/jobs/zaim]
google_cloud_run_service.app: Refreshing state... [id=locations/asia-northeast1/namespaces/kanade0404/services/zaim-api]
module.pubsub.google_pubsub_subscription.subscription["zaim-func-trigger"]: Refreshing state... [id=projects/kanade0404/subscriptions/zaim-func-trigger]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.app has changed
  ~ resource "google_cloud_run_service" "app" {
        id                         = "locations/asia-northeast1/namespaces/kanade0404/services/zaim-api"
        name                       = "zaim-api"
      ~ status                     = [
          ~ {
              ~ conditions                   = [
                  ~ {
                      ~ message = <<-EOT
                          - Revision 'zaim-api-00002-kfz' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8888 environment variable. Logs for this revision might contain more information.
                            
                          - Logs URL: https://console.cloud.google.com/logs/viewer?project=kanade0404&resource=cloud_run_revision/service_name/zaim-api/revision_name/zaim-api-00002-kfz&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22zaim-api%22%0Aresource.labels.revision_name%3D%22zaim-api-00002-kfz%22 
                          - For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      ~ reason  = "HealthCheckContainerError" -> ""
                      ~ status  = "False" -> "True"
                        # (1 unchanged attribute hidden)
                    },
                    {
                        message = ""
                        reason  = ""
                        status  = "True"
                        type    = "ConfigurationsReady"
                    },
                  ~ {
                      ~ message = <<-EOT
                          - Revision 'zaim-api-00002-kfz' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8888 environment variable. Logs for this revision might contain more information.
                            
                          - Logs URL: https://console.cloud.google.com/logs/viewer?project=kanade0404&resource=cloud_run_revision/service_name/zaim-api/revision_name/zaim-api-00002-kfz&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22zaim-api%22%0Aresource.labels.revision_name%3D%22zaim-api-00002-kfz%22 
                          - For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      ~ reason  = "HealthCheckContainerError" -> ""
                      ~ status  = "False" -> "True"
                        # (1 unchanged attribute hidden)
                    },
                ]
              ~ latest_created_revision_name = "zaim-api-00002-kfz" -> "zaim-api-00003-5zp"
              ~ latest_ready_revision_name   = "" -> "zaim-api-00003-5zp"
              ~ observed_generation          = 2 -> 3
              ~ traffic                      = [
                  ~ {
                      ~ revision_name   = "zaim-api-00001-pwx" -> "zaim-api-00003-5zp"
                        # (4 unchanged attributes hidden)
                    },
                ]
              ~ url                          = "" -> "https://zaim-api-vr35tgknva-an.a.run.app"
            },
        ]
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.app will be updated in-place
  ~ resource "google_cloud_run_service" "app" {
      ~ autogenerate_revision_name = false -> true
        id                         = "locations/asia-northeast1/namespaces/kanade0404/services/zaim-api"
        name                       = "zaim-api"
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ annotations           = {
              + "run.googleapis.com/ingress" = "internal"
            }
          ~ effective_annotations = {
              ~ "run.googleapis.com/ingress"        = "all" -> "internal"
                # (6 unchanged elements hidden)
            }
          ~ effective_labels      = {
              + "service"                       = "zaim"
                # (1 unchanged element hidden)
            }
          ~ terraform_labels      = {
              + "service" = "zaim"
            }
            # (6 unchanged attributes hidden)
        }

      ~ template {
          ~ spec {
              ~ service_account_name  = "zaim-func" -> "zaim-func@kanade0404.iam.gserviceaccount.com"
                # (2 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app:e6fa13de01d4a682767df911f8e1faa909c4a0c6" -> "asia-northeast1-docker.pkg.dev/kanade0404/projects/kanade0404/locations/asia-northeast1/repositories/zaim-api/app"
                    name    = "app-1"
                    # (2 unchanged attributes hidden)

                  + env {
                      + name  = "HOST"
                      + value = "https://zaim-api-vr35tgknva-an.a.run.app"
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.pubsub.google_pubsub_subscription.subscription["zaim-func-trigger"] will be updated in-place
  ~ resource "google_pubsub_subscription" "subscription" {
        id                           = "projects/kanade0404/subscriptions/zaim-func-trigger"
        name                         = "zaim-func-trigger"
        # (10 unchanged attributes hidden)

      + push_config {
          + push_endpoint = "https://zaim-api-vr35tgknva-an.a.run.app"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.pubsub-user.google_service_account.account will be created
  + resource "google_service_account" "account" {
      + account_id = "zaim-pubsub"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "kanade0404"
      + unique_id  = (known after apply)
    }

  # module.pubsub-user.google_service_account_iam_member.service_iam["iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_member" "service_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.pubsub-user.google_service_account_iam_member.service_iam["run.invoker"] will be created
  + resource "google_service_account_iam_member" "service_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/run.invoker"
      + service_account_id = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
module.pubsub-user.google_service_account.account: Creating...
google_cloud_run_service.app: Modifying... [id=locations/asia-northeast1/namespaces/kanade0404/services/zaim-api]
module.pubsub-user.google_service_account.account: Creation complete after 1s [id=projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com]
module.pubsub-user.google_service_account_iam_member.service_iam["iam.serviceAccountTokenCreator"]: Creating...
module.pubsub-user.google_service_account_iam_member.service_iam["run.invoker"]: Creating...
module.pubsub-user.google_service_account_iam_member.service_iam["iam.serviceAccountTokenCreator"]: Creation complete after 4s [id=projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:zaim-pubsub@kanade0404.iam.gserviceaccount.com]
Releasing state lock. This may take a few moments...

Error: resource is in failed state "Ready:False", message: Revision 'zaim-api-00004-z2b' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/kanade0404/projects/kanade0404/locations/asia-northeast1/repositories/zaim-api/app' not found.

  with google_cloud_run_service.app,
  on main.tf line 111, in resource "google_cloud_run_service" "app":
 111: resource "google_cloud_run_service" "app" {


Error: Error applying IAM policy for service account 'projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com': Error setting IAM policy for service account 'projects/kanade0404/serviceAccounts/zaim-pubsub@kanade0404.iam.gserviceaccount.com': googleapi: Error 400: Role roles/run.invoker is not supported for this resource., badRequest

  with module.pubsub-user.google_service_account_iam_member.service_iam["run.invoker"],
  on modules/service_account/main.tf line 13, in resource "google_service_account_iam_member" "service_iam":
  13: resource "google_service_account_iam_member" "service_iam" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"860327b468c6a0fa21baaf45c58c1d728c82190a","Vars":{},"WorkflowName":"Apply Terraform"} -->